app/views/pages/dashboard.html.erb

SELECT "rentals".* FROM "rentals"
---

<% Rental.all.each do |rental| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <div class="message-name">
    <h3><%= User.find(rental.user_id).email %></h3>

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  <div class="message-body">
    <p><strong><%= Car.find(rental.car_id).name %></strong></p>