app/views/pages/home.html.erb

    <div class="col-xs-12 col-sm-4">
    <div class="card"  style="background-image:url(<%= car.cars.first.url%>);">
---
SELECT  "cars".* FROM "cars" ORDER BY RAND(name) LIMIT $1  [["LIMIT", 5]]