app/controllers/cars_controller.rb

  def index
    @cars = Car.all.order :name
---
SELECT "cars".* FROM "cars" ORDER BY "cars"."name" ASC

  def search
    if params[:starts_on].nil?
      redirect_to cars_path
    else
      @available_car_id = Rental.where.not("starts_on >= ? AND ends_on <= ?", params[:starts_on], params[:ends_on]).pluck(:car_id)
      @available_cars = Car.find(@available_car_id)
---
SELECT "rentals"."car_id" FROM "rentals" WHERE (NOT (starts_on >= '2018-02-02T22:22' AND ends_on <= '2018-03-31T22:22'))
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "rentals".* FROM "rentals" WHERE (NOT (starts_on >= '2018-02-02T22:22' AND ends_on <= '2018-03-31T22:22'))

  def create
    @car = Car.new(car_params)
    if @car.save
---
INSERT INTO "cars" ("name", "description", "plaque", "created_at", "updated_at", "price_cents") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "fdsqfqdsf"], ["description", "fsdfdsf"], ["plaque", "fdsfdsf"], ["created_at", "2017-12-24 10:50:43.294499"], ["updated_at", "2017-12-24 10:50:43.294499"], ["price_cents", 15000]]

  def update
    @car.update(car_params)
---
UPDATE "cars" SET "cars" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["cars", "[\"5099ccee93420e86e94c1c958a59904b.jpeg\",\"a2b586945ba59ea1e0c4337e008ab81e.jpg\",\"c4f1b43d244905c8bf0bbaf1a8455932.jpeg\"]"], ["updated_at", "2017-12-25 22:15:26.371896"], ["id", 3]]