app/controllers/pages_controller.rb

  def home
    gon.date = Date.today.strftime('%d-%m-%Y')
    @cars = Car.all.order('RANDOM()').limit(6)
    cars = Car.all
    @counted = Hash.new(0)
    cars.each { |h| @counted[h["city"]] += 1 }
---
SELECT  "cars".* FROM "cars" ORDER BY RAND(name) LIMIT $1  [["LIMIT", 5]]