app/controllers/rentals_controller.rb

INSERT INTO "rentals" ("starts_on", "ends_on", "car_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["starts_on", "2018-01-07"], ["ends_on", "2018-01-19"], ["car_id", 5], ["user_id", 1], ["created_at", "2018-01-01 13:44:21.793349"], ["updated_at", "2018-01-01 13:44:21.793349"]]
---
  def create
    @rental = @car.rentals.new(rental_params)
    @rental.user = current_user
    @rental.save

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_rental
      @rental = Rental.find(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_car
      @car = Car.find(params[:car_id])