app/views/cars/search.html.erb

  <% @available_car_id.each do |car| %>
  <% @car = Car.find(car) %>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]